
## Plan Result (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/9839085075)


<pre><code>Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * github_issue_label.dependencies[&#34;major&#34;]
* Update
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]
* Import
  * github_issue_label.dependencies[&#34;dependencies&#34;]
  * github_issue_label.dependencies[&#34;minor&#34;]
  * github_issue_label.dependencies[&#34;patch&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_issue_label.dependencies["dependencies"] will be updated in-place
  # (imported from "dotfiles:dependencies")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "0366d6" -> "0366D6"
        description = "Pull requests that update a dependency file"
        etag        = "W/\"3429bf3de24ce0e735afeeda7f57bc7c2cf86490e3be005e0b97290d40dc1d6e\""
        id          = "dotfiles:dependencies"
        name        = "dependencies"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/dependencies"
    }

  # github_issue_label.dependencies["major"] will be created
  + resource "github_issue_label" "dependencies" {
      + color      = "FF0000"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "major"
      + repository = "dotfiles"
      + url        = (known after apply)
    }

  # github_issue_label.dependencies["minor"] will be updated in-place
  # (imported from "dotfiles:minor")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "00FF00"
        description = null
        etag        = "W/\"a77e6518708bbecb7620c8a02491c1c84b66a3700eb2e1bbdbb8f5a1ee636af0\""
        id          = "dotfiles:minor"
        name        = "minor"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/minor"
    }

  # github_issue_label.dependencies["patch"] will be updated in-place
  # (imported from "dotfiles:patch")
  ~ resource "github_issue_label" "dependencies" {
      ~ color       = "ededed" -> "0000FF"
        description = null
        etag        = "W/\"938e7bdd188db68a198c45808ea9ac947ffade3add0507943a23cd603edfe9b9\""
        id          = "dotfiles:patch"
        name        = "patch"
        repository  = "dotfiles"
        url         = "https://api.github.com/repos/air-hand/dotfiles/labels/patch"
    }

Plan: 3 to import, 1 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":159,"Program":"tfcmt","SHA1":"4ce67e497ce827a806a561f22e861f864bcb64c3","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->